Revit 2024 API
BRepBuilderEdgeGeometry Members
The BRepBuilderEdgeGeometry type exposes the following members.
Methods
Name | Description
Create(Curve)
 Construct BRepBuilderEdgeGeometry based on any GCurve, including GLine and GArc. The curve will be simplified if possible, and the concrete type of the returned value will reflect that simplification: BRepBuilderLinearEdgeGeometry if the curve could be simplified to a line, BRepBuilderArcEdgeGeometry if it could be simplified to an arc, BRepBuilderGenericCurveEdgeGeometry otherwise.
Create(XYZ, XYZ)
 Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points.
Dispose
Releases all resources used by the BRepBuilderEdgeGeometry
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
BRepBuilderEdgeGeometry Class
Autodesk.Revit.DB Namespace